print("Давай зіграємо у 'Хто хоче стати міліонером' ")
count = 0
while True:
    nachalo = input("Почнемо гру?(так,ні):")
    if nachalo == 'ні':
        print("Завершення гри")
    if nachalo == 'так':
        a = input("В якому році була Куликівська битва?Варіанти:1.1380/2.1567/3.1876?") 
        if a == '1':
            print("Правилно")
        else:
            print("Не правильно")
        b = input("Який титул мав Дон Кіхот?Варіанти:1.Барон/2.Маркіз/3.Ідальго?")
        if b == '3':
            print("Правильно")
        else:
            print("Не правильно")
        c = input("Як називають зірку, яка вказала волхвам на народження Христа?Варіанти:n1.Вифлеємська/2.Наднова/3.Андромеда?")
        if c == '1':
            print("Правильно!")
        else: 
            print("Не правильно:(")
        d = input("Який вид спорту самий популярний в кінофільмах?Варіанти:1.Біатлон./2.Бокс/3.Біг?")
        if d =='2':
            print("Правиьно:)")
        else:
            print("Не правильно")
        if a == '1' and b == '3' and c == '1' and d == '2':
            print("Молодець,ви виграли міліон")
        else:
            print("Молодець,що спробував!")
            


         